In [3]:
import sqlite3
import pandas as pd

In [4]:
airports_query = """
SELECT *
FROM airports
"""

In [5]:
with sqlite3.connect('data/flights.db') as con:
    airports_df = pd.read_sql(airports_query, con)

In [6]:
airports_df

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby
1,1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.7887,20,10,U,Pacific/Port_Moresby
2,2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10,U,Pacific/Port_Moresby
3,3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10,U,Pacific/Port_Moresby
4,4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.22005,146,10,U,Pacific/Port_Moresby
...,...,...,...,...,...,...,...,...,...,...,...,...,...
8102,8102,9537,Mansons Landing Water Aerodrome,Mansons Landing,Canada,YMU,\N,50.066667,-124.983333,0,-8,A,America/Vancouver
8103,8103,9538,Port McNeill Airport,Port McNeill,Canada,YMP,\N,50.575556,-127.028611,225,-8,A,America/Vancouver
8104,8104,9539,Sullivan Bay Water Aerodrome,Sullivan Bay,Canada,YTG,\N,50.883333,-126.833333,0,-8,A,America/Vancouver
8105,8105,9540,Deer Harbor Seaplane,Deer Harbor,United States,DHB,\N,48.618397,-123.00596,0,-8,A,America/Los_Angeles
8106,8106,9541,San Diego Old Town Transit Center,San Diego,United States,OLT,\N,32.7552,-117.1995,0,-8,A,America/Los_Angeles

In [7]:
schema_query = """
SELECT *
FROM sqlite_master
"""

In [8]:
with sqlite3.connect('data/flights.db') as con:
    schema_df = pd.read_sql(schema_query, con)

In [9]:
schema_df

,type,name,tbl_name,rootpage,sql
0,table,airports,airports,2,"CREATE TABLE airports (\n[index] INTEGER,\n [..."
1,index,ix_airports_index,airports,3,CREATE INDEX ix_airports_index ON airports ([i...
2,table,airlines,airlines,945,"CREATE TABLE airlines (\n[index] INTEGER,\n [..."
3,index,ix_airlines_index,airlines,946,CREATE INDEX ix_airlines_index ON airlines ([i...
4,table,routes,routes,1393,"CREATE TABLE routes (\n[index] INTEGER,\n [ai..."
5,index,ix_routes_index,routes,1394,CREATE INDEX ix_routes_index ON routes ([index])

In [10]:
print(schema_df['sql'].iloc[0])

CREATE TABLE airports (
[index] INTEGER,
  [id] TEXT,
  [name] TEXT,
  [city] TEXT,
  [country] TEXT,
  [code] TEXT,
  [icao] TEXT,
  [latitude] TEXT,
  [longitude] TEXT,
  [altitude] TEXT,
  [offset] TEXT,
  [dst] TEXT,
  [timezone] TEXT
)

In [11]:
basic_query = """
SELECT name, city, country
FROM airports
"""

In [12]:
with sqlite3.connect('data/flights.db') as con:
    basic_df = pd.read_sql(basic_query, con)

In [13]:
basic_df.head()

                         name          city           country
0                      Goroka        Goroka  Papua New Guinea
1                      Madang        Madang  Papua New Guinea
2                 Mount Hagen   Mount Hagen  Papua New Guinea
3                      Nadzab        Nadzab  Papua New Guinea
4  Port Moresby Jacksons Intl  Port Moresby  Papua New Guinea

In [14]:
distinct_query = """
SELECT DISTINCT country
FROM airports
"""

In [15]:
with sqlite3.connect('data/flights.db') as con:
    distinct_df = pd.read_sql(distinct_query, con)

In [16]:
distinct_df.head()

            country
0  Papua New Guinea
1         Greenland
2           Iceland
3            Canada
4           Algeria

In [17]:
alias_query = """
SELECT
    name AS "Airport Name",
    country AS "Airport Country"
FROM airports
"""

In [18]:
with sqlite3.connect('data/flights.db') as con:
    alias_df = pd.read_sql(alias_query, con)

In [19]:
alias_df.head()

                 Airport Name   Airport Country
0                      Goroka  Papua New Guinea
1                      Madang  Papua New Guinea
2                 Mount Hagen  Papua New Guinea
3                      Nadzab  Papua New Guinea
4  Port Moresby Jacksons Intl  Papua New Guinea

In [20]:
count_query = """
SELECT COUNT(*) AS "Number of Airports"
FROM airports
"""

In [21]:
with sqlite3.connect('data/flights.db') as con:
    count_df = pd.read_sql(count_query, con)

In [22]:
count_df

   Number of Airports
0                8107